# AnalyticalGridCellSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..AnalyticalGridCellSize Property
EnergyDataSettings Class See Also
---
The cell size for the uniform cubical grid used when computing the building envelope
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double AnalyticalGridCellSize { get; set; }
```

Visual Basic
---
```text
Public Property AnalyticalGridCellSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AnalyticalGridCellSize {
	double get ();
	void set (double value);
}
```

# Remarks
This is the size of the "cubes" used to divide the building shell bounding box into a uniform cubical 3D grid.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace